//
//  TourismInformation.swift
//  KyivTourismApp
//
//  Created by Andrew on 29.12.2020.
//

import Foundation
import SwiftUI

class TourismInformation: UIViewController {
    @IBOutlet weak var menuBarButton: UIBarButtonItem!
    @IBOutlet weak var theContainer: UIView!
    
    override func viewDidLoad() {
        super.viewDidLoad()
        self.setMenu(menuBarButton)
        addSwiftUIView()
    }
    
    func addSwiftUIView() {
        let childView = UIHostingController(rootView: TourismInformationView())
        addChild(childView)
        childView.view.frame = theContainer.bounds
        theContainer.addConstrained(subview: childView.view)
        childView.didMove(toParent: self)
    }
}

struct TourismInformationView: View {
    var body: some View {
        ScrollView {
            VStack(alignment: .leading, spacing: 20) {
                Text("Туристична інформація")
                    .font(.largeTitle)
                    .fontWeight(.medium)
                
                Image("someKyivChurch")
                    .resizable()
                    .scaledToFit()
                
                Text("Київ – столиця і найбільше місто України.")
                    .font(.title)
                    .fontWeight(.medium)
                
                Group {
                    Text("Київ – окрема адміністративно-територіальна одиниця України, культурний, політичний, соціально-економічний, транспортний, науковий та правничий центр країни. Розташовано на річці Дніпро. Київ – шосте за населенням місто Європи після Москви, Лондону, Санкт-Петербургу, Берліну та Мадриду.")
                        
                    Text("За свою довгу історію Київ був столицею полян, Київської Русі, Київського княжества, Української Народної Республіки, Української Держави, Української Радянської Соціалістичної Республіки, а з 1991 року – незалежної України.")

                    Text("Місто має свій герб та прапор. В силу свого історичного значення як центру Київської Русі, місто і понині називають «Матір’ю міст руських». Площа його становить 827 кв. км та поділена на 14 адміністративних районів. Протяжність з півночі на південь – 50 км, з заходу на схід – 56 км.")

                    Text("З 1960 року в Києві працює метрополітен.")

                    Text("В 2005 році столиця України стала місцем проведення 50-го музичного конкурсу Євробачення, а в 2012 році одним з чотирьох українських міст, що приймали Чемпіонат Європи з футболу ЄВРО-2012.")
                    
                    Text("Для того, щоб ознайомитись з основними визначними місцями Києва, туристам не потрібен громадський транспорт, адже  центральну та історичну частину міста можна обійти пішки.")
                }
                
                Text("Найближчі визначні місця до готелю")
                    .font(.title)
                    .fontWeight(.medium)
                
                Group {
                    Text("Києво-Печерська Лавра – один з перших монастирів з часу існування Київської Русі, заснована в 1051 році в період правління Ярослава Мудрого монахом Антонієм, родом з Любеча. Знаходиться на правому березі Дніпра. Перші монахи селились в печерах, саме звідси походить назва Печерська. Лавра – це почесне звання, що надавалось лиaше крупним та величним монастирям. Взявши початок від перших печер, закладених в 11 столітті, протягом 9 століть Києво-Печерська Лавра зросла до величного комплексу церков та монастирів, що вражають не лише вірян, але й звичайних туристів.")
                    
                    Button("Більш детальну інформацію можна знайти тут.") {
                        let url = URL(string: "http://lavra.ua/?lang=ukrainian")
                        UIApplication.shared.open(url!)
                    }

                    Text("Національний музей історії Великої Вітчизняної війни 1941–1945 років у Києві являє собою меморіальний комплекс та вміщує величну чашу Вічного вогню, виставку воєнної техніки часів Другої світової війни, а також післявоєнних років, алею Міст героїв. Головну скульптуру – монумент «Батьківщина-мати» – фігуру жінки зі щитом і мечем у руках створено з листової неіржавіючої сталі та встановлено на конусному п'єдесталі 40-метрової висоти. Висота скульптури від п'єдесталу до кінчика меча – 62 м, загальна висота – 102 м, вага – близько 500 т.")
                    
                    Button("Більш детальну інформацію можна знайти тут.") {
                        let url = URL(string: "http://www.warmuseum.kiev.ua/ukr/anonsy.shtml")
                        UIApplication.shared.open(url!)
                    }

                    Text("Національний ботанічний сад входить до природно-заповідного фонду України. Сьогодні він за різноманітністю колекцій живих рослин, масштабами території, рівнем наукових досліджень, займає одне з провідних місць серед найбільших ботанічних садів Європи. До складу ботанічного саду входить 8 наукових відділів, унікальний колекційний фонд ботанічного саду налічує близько 11 180 таксонів, що відносяться до 220 родин та 1347 родів.")
                    
                    Button("Більш детальну інформацію можна знайти тут.") {
                        let url = URL(string: "http://www.nbg.kiev.ua/ru/")
                        UIApplication.shared.open(url!)
                    }

                    Text("Пирогів – музей народної архітектури та побуту України під відкритим небом, було засновано в 1969 році. Експозицію Музею розміщено в унікальному етнографічному ландшафті з розлогими долинами, байраками, каскадом старовинних ставків, давньоруськими курганами, старожитнім селом Пирогів. Розмаїття ландшафту дало змогу на площі 147 га показати в характерному оточенні понад 300 унікальних пам'яток народного будівництва 16-19 ст. У фондах Музею зберігається понад 70 тисяч пам'яток декоративно-вжиткового мистецтва, знарядь праці, предметів побуту, серед яких значна колекція ікон, рушників, одягу, кераміки, одна з найкращих колекцій народних музичних інструментів. Найтиповіші пам'ятки традиційної архітектури: хати, комори, клуні, повітки, сажі, курники, погреби – сформовано в садиби.")
                    
                    Button("Більш детальну інформацію можна знайти тут.") {
                        let url = URL(string: "http://www.pyrohiv.com.ua/")
                        UIApplication.shared.open(url!)
                    }

                    Text("Київський дельфінарій «Немо» – один з найсучасніших культурно-оздоровчих центрів Європи, що об’єднав у собі дельфінарій та центр дельфінотерапії. В київскому дельфінарії живуть південні морські котики Клепа, Норма та Ронні, а також чарівні тихоокеанські дельфіни Шкіпер, Наллі, Доцман та Дорі.")
                    
                    Button("Більш детальну інформацію можна знайти тут.") {
                        let url = URL(string: "http://nemokiev.com/")
                        UIApplication.shared.open(url!)
                    }
                }
                
                Text("Інші визначні місця")
                    .font(.title)
                    .fontWeight(.medium)
                
                Group {
                    Text("Хрещатик – це головна вулиця міста. У вихідні та святкові дні вулиця відкрита лише для пішоходів, що робить прогулянку більш цікавою та захопливою. Вулиця пересікає центральну площу міста – площу Незалежності.")
                        
                    Text("Софійський Собор – християнський собор, пам'ятка української архітектури і монументального живопису 11-18 століть, одна з небагатьох уцілілих споруд часів Київської Русі. Було збудовано за наказом Ярослава Мудрого в стилі українського бароко. Одна з найголовніших християнських святинь Східної Європи, історичний центр Київської митрополії. Собор, як головний храм держави, відігравав роль не тільки духовного, а й політичного та культурного центру. Під склепінням Cв. Софії відбувалися урочисті «посадження» на великокняжий престол, церковні собори, прийоми послів, затвердження політичних угод. При соборі велося літописання і були створені перші відомі на Русі бібліотека та школа. Софійський собор перебуває у списку Всесвітньої спадщини ЮНЕСКО.")
                    
                    Button("Більш детальну інформацію можна знайти тут.") {
                        let url = URL(string: "http://nzsk.org.ua/")
                        UIApplication.shared.open(url!)
                    }

                    Text("Михайлівський Золотоверхий монастир споруджений у 1108-1113 роках онуком Ярослава Мудрого київським князем Святополком. Хрестово-купольний шестистовпний храм з трьома нефами та одним позолоченим куполом. Собор було збудовано з каміння і цегли-плінфи на вапняно-цем'яковому розчині технікою «мішаної кладки» з використанням голосників у пазухах склепінь. Стіни собору прикрашали мозаїки і фрески. Був одним з найбільших монастирів Стародавнього Києва. На території монастиря знаходиться Київська православна богословська академія та храм святого апостола і євангелиста Іоана Богослова.")

                    Text("Київський фунікулер допоможе Вам дістатися до однієї з найстаріших частин Києва – Подолу. Насолодіться архітектурою 18-го століття та старими київськими дворами.")

                    Text("Андріївська церква – барокова церква Святого Андрія у Києві. Збудована в 1744-1767 роках за проектом архітектора Бартоломео Растреллі на Андріївській горі в пам'ять відвідин Києва імператрицею Єлизаветою Петрівною, на місці Хрестовоздвиженської церкви. Однокупольний храм з п'ятиглавим завершенням має форму хреста, в кутах якого розміщені декоративні вежі на масивних стовпах, що відіграють роль своєрідних контрфорсів. Вся маса церкви спирається на двоповерховий будинок-стилобат з 8 кімнатами на кожному поверсі, стіни якого являють собою фундаменти церкви. Навколо церкви — балюстрада, з якої відкривається мальовнича панорама Подолу й Дніпра.")

                    Text("Андріївський узвіз – історична вулиця-музей Києва, що з’єднує Поділ з центральною частиною міста. Сучасну назву узвіз одержав у 1740-х роках, а нинішня забудова склалася вже наприкінці 19 – на початку 20 століття. І сьогодні Андріївський узвіз зберігся у неповторній своїй мальовничості. Нині вулиця оновлена і стилізована у дусі ХІХ століття, відтак причаровує і туристів, і любителів старовини. Тротуари вимощено спеціальною цеглою, виготовленою за старовинним рецептом, оновлено бруківку проїзної частини. Особливої чарівності надають вулиці чавунні ліхтарі, виготовлені за старовинним малюнками. Андріївський узвіз став справжнім музеєм просто неба. Щовесни тут влаштовується свято мистецтв, художні виставки. Більше того, з 1991 року це улюблене місце гулянь усіх киян на день Києва та на День Незалежності.")

                    Text("Маріїнський палац у Києві зведений у 1750-1755 роках за зразком палацу, який проектував Бартоломео Растреллі для Гетьмана Розумовського. 1744 року імператриця Єлизавета Петрівна під час відвідувань Києва, сама вибрала для нього місце. Палац знаходиться поряд з Верховною Радою України та являється церемоніальною резиденцією Президента України.")

                    Text("Маріїнський парк – один з найпопулярніших парків Києва. Спроектовано в пейзажному стилі. Тихий, тінистий, зі старими липами, кленами та каштанами, він являє собою унікальний пам’ятник паркового мистецтва минулого. Центральний вхід у парк – навпроти Верховної Ради України та Маріїнського палацу.")
                    
                    Group{
                        Text("Будинок з химерами в стилі модерн отримав свою назву дякуючи скульптурним прикрасам (що розташовані як на фасаді дому, так і всередині нього), тематика яких – наземний та підводний тваринний світ, атрибути мисливства, казкові персонажі. Будівля розташована навпроти Адміністрації Президента України. Архітектор Владислав Городецький звів її в 1901-1903 роках як прибутковий будинок з приміщеннями для власної родини. Скульптурні прикраси по власним ескізам виконав скульптор Еліо Саля. В наш час будинок працює в якості резиденції Президента України з весни 2005 року.")

                        Text("Золоті ворота – один з небагатьох пам’ятків оборонного зодчества Київської Русі періоду правління Ярослава Мудрого. В наші дня працює як музей.")

                        Text("Володимирський собор – головний храм Української православної церкви Київського патріархату. Являє собою традиційний для російського зодчества шестистовповий храм з трьома апсидами, увінчаний сімома куполами.")

                        Text("Національна опера України була заснована в 1876 році і стала однією з кращих в Україні. Поштовхом до створення постійно діючого театру стали успішні гастролі італійських оперних труп 1865-66 роках у Києві. Трупа працювала у приміщенні Міського театру, збудованого в 1856 році за проектом архітектора І. Штрома.")
                    }
                }
            }.padding(.all)
        }
    }
}
